# SlabShapeWarnVerticesCoincident Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SlabShapeFailures..::..SlabShapeWarnVerticesCoincident Property
BuiltInFailures..::..SlabShapeFailures Class See Also
---
Some slab shape edit vertices were too close to each other or too close to an edge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SlabShapeWarnVerticesCoincident { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlabShapeWarnVerticesCoincident As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SlabShapeWarnVerticesCoincident {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SlabShapeFailures Class
Autodesk.Revit.DB Namespace